import pandas as pd
import pytest

from src.reports import spending_by_category


@pytest.fixture
def operations_1():
    transcations_df = pd.read_excel("../data/operations_1.xlsx")
    return transcations_df


@pytest.fixture
def operations_2():
    transcations_df = pd.read_excel("../data/operations_2.xlsx")
    return transcations_df


def test_filtring_by_date():
    assert spending_by_category(operations_1, " Фастфуд", "2021-10-01 15:45:34") == [
        {
            "Дата операции": "29.12.2021 16:22:08",
            "Дата платежа": "29.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -120.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -120.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Фастфуд",
            "MCC": 5814,
            "Описание": "Mouse Tail",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 120.0,
        },
        {
            "Дата операции": "26.12.2021 22:09:56",
            "Дата платежа": "27.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -415.32,
            "Валюта операции": "RUB",
            "Сумма платежа": -415.32,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Фастфуд",
            "MCC": 7512,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 20,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 415.32,
        },
    ]
    assert spending_by_category(operations_2, "Каршеринг", "2021-10-01 15:45:34") == [
        {
            "Дата операции": "26.12.2021 22:09:56",
            "Дата платежа": "27.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -415.32,
            "Валюта операции": "RUB",
            "Сумма платежа": -415.32,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7512,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 20,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 415.32,
        },
        {
            "Дата операции": "25.12.2021 22:21:49",
            "Дата платежа": "26.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -218.07,
            "Валюта операции": "RUB",
            "Сумма платежа": -218.07,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7512,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 10,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 218.07,
        },
        {
            "Дата операции": "22.12.2021 23:23:01",
            "Дата платежа": "23.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -26.19,
            "Валюта операции": "RUB",
            "Сумма платежа": -26.19,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Каршеринг",
            "MCC": 7512,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 26.19,
        },
    ]
